---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.ZOffset
source: html/df49b65c-35a0-f63b-c5a8-fc0e6d3010ec.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.ZOffset Property

Z offset.

## Syntax (C#)
```csharp
public double ZOffset { get; }
```